// ! git init
// 1. Создется или (инициализируется) 
// локальное хранилище. Прописывается только один раз вначале,
// когда создается новый репазитроий в Github

// ! git Add название_файла (либо символ точка, ) 
//  ! для того что бы добавить все файлы 

// 2. Выбирается файл или все файлы, которые 
// нужно отправить на удаленный репазиторий (Github)

// ! git commit  - "Название коммита ... "

// 3. Git Прослеживает и отмечает для себя произведенные 
// изменения в проекте.

// ! git bracnh 
 // Этой командой можно по смотреть какие ветки 
 // существуют.

// ! git brach название_новой_ветки 
// Этой командой создается новая ветка 


// ! git checkout название_ветки 
// выбирается нужная ветка, в которую дальнейшом  
// будут сохранятся все изменения 

// ! git checkout -b название_новой_ветки 
// Создаем новую ветку и сразу же преходим по ней 

// ! git URl 
// 4. добавляется URL ссылка для того что бы 
// соединится с удаленным репазиторием. 
// (вводится один раз при создании нового репазитория.)

// ! git Push название_репазитория(origin)
// название_ветки 
// 5. вс изменения загружаются на Гитхаб.
// ! =============== Клонится = = = = = == = =

// ! git clone SSH/HTTPS_Ключ
// с помощю этой команды можно скопировать 
// себе проект чужого чела.

// ! git Pull Название_репазитория и название_ветки 
// с этой командой можно стянуть все изменения 
// котрые сделал тимлид проекта 





